First/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

First/src/Documents/УстановкаЦен/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Дата = Формат(ПараметрыСеанса.ВремяНачалаСеанса, "ДЛФ=DT");
    Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Согласовано Тогда
		  Отказ = Истина;
		  Сообщить("Необходимо установить галку Согласовано (возможно только с Полными Правами)");
	Иначе Отказ = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЦеныПоставщиков
	Движения.ЦеныПоставщиков.Записывать = Истина;
	ТЗСвернутая = Цены.Выгрузить();

	// Ищем дубли
	ДубльЗаписи = Ложь;
	Для Каждого ТекСтрокаЦены Из ТЗСвернутая Цикл
		Для Каждого ТекСтрокаЦеныДубль Из ТЗСвернутая Цикл
			Если ТекСтрокаЦеныДубль.Номенклатура = ТекСтрокаЦены.Номенклатура И 
				 ТЗСвернутая.Индекс(ТекСтрокаЦеныДубль) <> ТЗСвернутая.Индекс(ТекСтрокаЦены) Тогда
				 ДубльЗаписи = Истина;
				 ДубльНоменклатуры = ТекСтрокаЦены.Номенклатура;
			 КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// Пишем, если дублей нет
	Если ДубльЗаписи = Ложь Тогда
		Для Каждого ТекСтрокаЦены Из ТЗСвернутая Цикл
		
			Если ДубльЗаписи = Ложь Тогда
				Движение = Движения.ЦеныПоставщиков.Добавить();
				Движение.Период = Дата;
				Движение.Номенклатура = ТекСтрокаЦены.Номенклатура;
				Движение.Контрагент = Контрагент;
				Движение.Цена = ТекСтрокаЦены.Цена;
				Движение.Ответственный = Ответственный;
			КонецЕсли;
		КонецЦикла;
	// Сообщаем, если нашли дубли
	Иначе Сообщить(СтрШаблон("В таблице цен дублируется Номенклатура ""%1""", ДубльНоменклатуры));
	КонецЕсли;

КонецПроцедуры
